In [1]:
print('Hello')

Hello

In [2]:
age = 25

In [3]:
name = 'Sasha'

In [4]:
name

'Sasha'

In [5]:
user_info = ["Ivan", "Ivanov", 1000.0, 1]
user_info

['Ivan', 'Ivanov', 1000.0, 1]

In [6]:
user_info[0]

'Ivan'

In [7]:
['Ivan', 'Ivanov', 1000.0, 1][0]

'Ivan'

In [8]:
salaries = [1, 2, 3, 4, 5]

In [9]:
salaries

[1, 2, 3, 4, 5]

In [10]:
salaries[0]

1

In [11]:
salaries[-1]

5

In [12]:
users = ["Courses", 42, False]

In [13]:
users

['Courses', 42, False]

In [14]:
users.append(8)

In [15]:
users

['Courses', 42, False, 8]

In [16]:
worker = ['Sasha', 'Ivanov', 75000.0, 1]

In [17]:
worker

['Sasha', 'Ivanov', 75000.0, 1]

In [18]:
status = '{} {} is {}'

In [19]:
status

'{} {} is {}'

In [20]:
experience = worker[-1]
if experience < 2:
    position = 'junior'
elif 2 <= experience <= 5:
    position = 'middle'
else:
    positon = 'senior'

In [21]:
status = status.format(worker[0], worker[1], position)

In [22]:
values = [15, 0, 10, 100, 150, 165, 1001, 45, -30]

In [23]:
x = []

In [24]:
for value in values:
    if (value % 10) == 0:
        x += [value]

In [25]:
x

[0, 10, 100, 150, -30]

In [26]:
(100 % 10) == 0

True

In [27]:
import pandas as pd

In [28]:
df = pd.read_csv('C:/Users/Marat SHagitov/Documents/GitHub/Study/Python/test.csv')

In [29]:
df.tail()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
20249,BDCQ.SEE3999A,2017.06,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20250,BDCQ.SEE3999A,2017.09,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20251,BDCQ.SEE3999A,2017.12,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20252,BDCQ.SEE3999A,2018.03,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20253,BDCQ.SEE3999A,2018.06,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

In [30]:
df.shape

(20254, 14)

In [31]:
df.dtypes

Series_reference     object
Period              float64
Data_value          float64
Suppressed           object
STATUS               object
UNITS                object
Magnitude             int64
Subject              object
Group                object
Series_title_1       object
Series_title_2       object
Series_title_3       object
Series_title_4      float64
Series_title_5      float64
dtype: object

In [32]:
df.describe()

,Period,Data_value,Magnitude,Series_title_4,Series_title_5
count,20254.000000,1.579500e+04,20254.000000,0.0,0.0
mean,2016.343661,6.157889e+04,2.378493,NaN,NaN
std,3.215943,1.860380e+05,2.934988,NaN,NaN
min,2011.060000,1.225683e+00,0.000000,NaN,NaN
25%,2014.030000,1.234000e+03,0.000000,NaN,NaN
50%,2016.120000,1.059100e+04,0.000000,NaN,NaN
75%,2019.090000,4.351000e+04,6.000000,NaN,NaN
max,2022.060000,2.196974e+06,6.000000,NaN,NaN

In [33]:
df.columns

Index(['Series_reference', 'Period', 'Data_value', 'Suppressed', 'STATUS',
       'UNITS', 'Magnitude', 'Subject', 'Group', 'Series_title_1',
       'Series_title_2', 'Series_title_3', 'Series_title_4', 'Series_title_5'],
      dtype='object')

In [34]:
df['Period']

0        2011.06
1        2011.09
2        2011.12
3        2012.03
4        2012.06
          ...
20249    2017.06
20250    2017.09
20251    2017.12
20252    2018.03
20253    2018.06
Name: Period, Length: 20254, dtype: float64

In [35]:
df[['Period', 'Data_value']].head()

    Period  Data_value
0  2011.06     80078.0
1  2011.09     78324.0
2  2011.12     85850.0
3  2012.03     90743.0
4  2012.06     81780.0

In [36]:
df.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [37]:
df = pd.read_csv('C:/Users/Marat SHagitov/Documents/GitHub/Study/Python/testX.csv')

In [38]:
df

,Year,Institutional_sector_name,Institutional_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Status,Values
0,2008.03,Corporate business enterprises,141,Capital Account Opening balances Produced non-...,LS00000,AN10000,REVISED,225544
1,2009.03,Corporate business enterprises,141,Capital Account Opening balances Produced non-...,LS00000,AN10000,REVISED,243315
2,2010.03,Corporate business enterprises,141,Capital Account Opening balances Produced non-...,LS00000,AN10000,REVISED,259381
3,2011.03,Corporate business enterprises,141,Capital Account Opening balances Produced non-...,LS00000,AN10000,REVISED,262596
4,2012.03,Corporate business enterprises,141,Capital Account Opening balances Produced non-...,LS00000,AN10000,REVISED,267100
...,...,...,...,...,...,...,...,...
18715,2013.03,Pension funds,261,Financial liabilities Closing balance Total fi...,LE00000,AFL0000,FINAL,53768
18716,2014.03,Pension funds,261,Financial liabilities Closing balance Total fi...,LE00000,AFL0000,REVISED,58559
18717,2015.03,Pension funds,261,Financial liabilities Closing balance Total fi...,LE00000,AFL0000,REVISED,70099
18718,2016.03,Pension funds,261,Financial liabilities Closing balance Total fi...,LE00000,AFL0000,REVISED,76021
18719,2017.03,Pension funds,261,Financial liabilities Closing balance Total fi...,LE00000,AFL0000,FINAL,85190

In [39]:
df = pd.read_csv('C:/Users/Marat SHagitov/Documents/GitHub/Study/Python/testXx.csv')

In [40]:
df

,Series_reference,Period,Data_value,STATUS,UNITS,MAGNTUDE,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,PRDA.S1CAAZI,1978.03,1000.0,FINAL,Index,0,Productivity Statistics - PRD,Productivity Indexes - Industry Level (ANZSIC06),Capital,"Agriculture, Forestry and Fishing",Index,NaN,NaN
1,PRDA.S1CAAZI,1979.03,947.0,FINAL,Index,0,Productivity Statistics - PRD,Productivity Indexes - Industry Level (ANZSIC06),Capital,"Agriculture, Forestry and Fishing",Index,NaN,NaN
2,PRDA.S1CAAZI,1980.03,1054.0,FINAL,Index,0,Productivity Statistics - PRD,Productivity Indexes - Industry Level (ANZSIC06),Capital,"Agriculture, Forestry and Fishing",Index,NaN,NaN
3,PRDA.S1CAAZI,1981.03,1167.0,FINAL,Index,0,Productivity Statistics - PRD,Productivity Indexes - Industry Level (ANZSIC06),Capital,"Agriculture, Forestry and Fishing",Index,NaN,NaN
4,PRDA.S1CAAZI,1982.03,1144.0,FINAL,Index,0,Productivity Statistics - PRD,Productivity Indexes - Industry Level (ANZSIC06),Capital,"Agriculture, Forestry and Fishing",Index,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
14393,PRDA.S4LMSZP,2017.03,1.7,FINAL,Percent,0,Productivity Statistics - PRD,Productivity Growth Accounting (ANZSIC06),"Annual percentage change, labour inputs index,...",NaN,NaN,NaN,NaN
14394,PRDA.S4LMSZP,2018.03,1.3,FINAL,Percent,0,Productivity Statistics - PRD,Productivity Growth Accounting (ANZSIC06),"Annual percentage change, labour inputs index,...",NaN,NaN,NaN,NaN
14395,PRDA.S4LMSZP,2019.03,1.7,FINAL,Percent,0,Productivity Statistics - PRD,Productivity Growth Accounting (ANZSIC06),"Annual percentage change, labour inputs index,...",NaN,NaN,NaN,NaN
14396,PRDA.S4LMSZP,2020.03,0.5,FINAL,Percent,0,Productivity Statistics - PRD,Productivity Growth Accounting (ANZSIC06),"Annual percentage change, labour inputs index,...",NaN,NaN,NaN,NaN
14397,PRDA.S4LMSZP,2021.03,-1.7,PROVISIONAL,Percent,0,Productivity Statistics - PRD,Productivity Growth Accounting (ANZSIC06),"Annual percentage change, labour inputs index,...",NaN,NaN,NaN,NaN

In [41]:
df.Period.sum()

28827130.939999994

In [42]:
df.groupby('Period', as_index=False).aggregate({'Data_value': 'sum'}).sort_values('Data_value')

     Period  Data_value
1   1979.03    159341.9
0   1978.03    159931.0
2   1980.03    160729.9
3   1981.03    161404.3
4   1982.03    165290.1
5   1983.03    167764.8
6   1984.03    171292.5
7   1985.03    177488.0
8   1986.03    183010.3
9   1987.03    186588.9
12  1990.03    188558.8
11  1989.03    188719.3
10  1988.03    189119.1
13  1991.03    191789.4
14  1992.03    192290.1
15  1993.03    192709.0
16  1994.03    200003.4
17  1995.03    205561.7
18  1996.03    323203.0
19  1997.03    331984.2
20  1998.03    336837.2
21  1999.03    340337.5
22  2000.03    398780.6
23  2001.03    407063.8
24  2002.03    414670.6
25  2003.03    425040.6
26  2004.03    436227.2
27  2005.03    445189.9
28  2006.03    453826.9
29  2007.03    461388.3
32  2010.03    471195.6
31  2009.03    473209.8
30  2008.03    473237.6
33  2011.03    473723.9
34  2012.03    479411.5
35  2013.03    486137.9
36  2014.03    496148.8
37  2015.03    510130.9
38  2016.03    521829.0
39  2017.03    531752.9
40  2018.03    543287.1
43  2021.03    550450.1
41  2019.03    557925.2
42  2020.03    564360.0

In [43]:
df.groupby('Period', as_index=False).aggregate({'Data_value': 'sum'}).sort_values('Data_value', ascending=False)

     Period  Data_value
42  2020.03    564360.0
41  2019.03    557925.2
43  2021.03    550450.1
40  2018.03    543287.1
39  2017.03    531752.9
38  2016.03    521829.0
37  2015.03    510130.9
36  2014.03    496148.8
35  2013.03    486137.9
34  2012.03    479411.5
33  2011.03    473723.9
30  2008.03    473237.6
31  2009.03    473209.8
32  2010.03    471195.6
29  2007.03    461388.3
28  2006.03    453826.9
27  2005.03    445189.9
26  2004.03    436227.2
25  2003.03    425040.6
24  2002.03    414670.6
23  2001.03    407063.8
22  2000.03    398780.6
21  1999.03    340337.5
20  1998.03    336837.2
19  1997.03    331984.2
18  1996.03    323203.0
17  1995.03    205561.7
16  1994.03    200003.4
15  1993.03    192709.0
14  1992.03    192290.1
13  1991.03    191789.4
10  1988.03    189119.1
11  1989.03    188719.3
12  1990.03    188558.8
9   1987.03    186588.9
8   1986.03    183010.3
7   1985.03    177488.0
6   1984.03    171292.5
5   1983.03    167764.8
4   1982.03    165290.1
3   1981.03    161404.3
2   1980.03    160729.9
0   1978.03    159931.0
1   1979.03    159341.9

In [44]:
df.query("STATUS == 'REVISED'").groupby('Period', as_index=False).aggregate({'Data_value': 'sum'})

     Period  Data_value
0   1991.03     36845.0
1   2003.03      1155.0
2   2005.03         1.3
3   2006.03      7299.3
4   2007.03     12228.0
5   2008.03      6478.0
6   2009.03      7437.0
7   2010.03     11262.0
8   2011.03     13677.0
9   2012.03     12035.0
10  2013.03      8323.0
11  2014.03     25475.4
12  2015.03     18954.0
13  2016.03     12524.0
14  2017.03     24094.0
15  2018.03     10539.0
16  2019.03     22262.8
17  2020.03     29476.2
18  2021.03    103443.1

In [45]:
df.Period.unique()

array([1978.03, 1979.03, 1980.03, 1981.03, 1982.03, 1983.03, 1984.03,
       1985.03, 1986.03, 1987.03, 1988.03, 1989.03, 1990.03, 1991.03,
       1992.03, 1993.03, 1994.03, 1995.03, 1996.03, 1997.03, 1998.03,
       1999.03, 2000.03, 2001.03, 2002.03, 2003.03, 2004.03, 2005.03,
       2006.03, 2007.03, 2008.03, 2009.03, 2010.03, 2011.03, 2012.03,
       2013.03, 2014.03, 2015.03, 2016.03, 2017.03, 2018.03, 2019.03,
       2020.03, 2021.03])

In [46]:
from datetime import datetime

In [47]:
today_day = datetime.today().strftime("%Y-%m-%d")

In [48]:
file_name = 'money_title_{}.csv'

In [49]:
file_name.format(today_day)

'money_title_2022-10-30.csv'

In [50]:
pd

In [51]:
taxi = pd.read_csv('https://stepik.org/media/attachments/lesson/360340/2_taxi_nyc.csv')

In [52]:
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [53]:
taxi.shape  # (число строк, число столбцов)

(29101, 14)

In [54]:
taxi.head

<bound method NDFrame.head of                  pickup_dt pickup_month        borough  pickups hday  spd  \
0      2015-01-01 01:00:00          Jan          Bronx      152    Y  5.0
1      2015-01-01 01:00:00          Jan       Brooklyn     1519    Y  5.0
2      2015-01-01 01:00:00          Jan            EWR        0    Y  5.0
3      2015-01-01 01:00:00          Jan      Manhattan     5258    Y  5.0
4      2015-01-01 01:00:00          Jan         Queens      405    Y  5.0
...                    ...          ...            ...      ...  ...  ...
29096  2015-06-30 23:00:00          Jun            EWR        0    N  7.0
29097  2015-06-30 23:00:00          Jun      Manhattan     3828    N  7.0
29098  2015-06-30 23:00:00          Jun         Queens      580    N  7.0
29099  2015-06-30 23:00:00          Jun  Staten Island        0    N  7.0
29100  2015-06-30 23:00:00          Jun            NaN        3    N  7.0

        vsb  temp  dewp     slp  pcp 01  pcp 06  pcp 24   sd
0      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
1      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
2      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
3      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
4      10.0  30.0   7.0  1023.5     0.0     0.0     0.0  0.0
...     ...   ...   ...     ...     ...     ...     ...  ...
29096  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29097  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29098  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29099  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0
29100  10.0  75.0  65.0  1011.8     0.0     0.0     0.0  0.0

[29101 rows x 14 columns]>

In [55]:
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [56]:
taxi.dtypes.value_counts()

float64    9
object     4
int64      1
dtype: int64

In [57]:
taxi.borough

0                Bronx
1             Brooklyn
2                  EWR
3            Manhattan
4               Queens
             ...
29096              EWR
29097        Manhattan
29098           Queens
29099    Staten Island
29100              NaN
Name: borough, Length: 29101, dtype: object

In [58]:
taxi = taxi.rename(columns={'pcp 01': 'pcp_01', 'pcp 06': 'pcp_06', 'pcp 24': 'pcp_24'})

In [59]:
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [60]:
taxi = pd.read_csv('https://stepik.org/media/attachments/lesson/360340/2_taxi_nyc.csv')

In [61]:
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [62]:
def underscore_rename(name):
    return name.replace(' ', '_')

In [63]:
taxi.rename(columns=underscore_rename)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [64]:
taxi = taxi.rename(columns=underscore_rename)

In [65]:
taxi.query('borough == "Brooklyn"')

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
8,2015-01-01 02:00:00,Jan,Brooklyn,1229,Y,3.0,10.0,30.0,6.0,1023.0,0.0,0.0,0.0,0.0
15,2015-01-01 03:00:00,Jan,Brooklyn,1601,Y,5.0,10.0,30.0,8.0,1022.3,0.0,0.0,0.0,0.0
22,2015-01-01 04:00:00,Jan,Brooklyn,1390,Y,5.0,10.0,29.0,9.0,1022.0,0.0,0.0,0.0,0.0
29,2015-01-01 05:00:00,Jan,Brooklyn,759,Y,5.0,10.0,28.0,9.0,1021.8,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29069,2015-06-30 19:00:00,Jun,Brooklyn,777,N,5.0,10.0,80.0,58.0,1012.5,0.0,0.0,0.0,0.0
29076,2015-06-30 20:00:00,Jun,Brooklyn,817,N,8.0,10.0,80.0,58.0,1012.4,0.0,0.0,0.0,0.0
29083,2015-06-30 21:00:00,Jun,Brooklyn,829,N,7.0,10.0,76.0,61.0,1012.4,0.0,0.0,0.0,0.0
29089,2015-06-30 22:00:00,Jun,Brooklyn,860,N,5.0,10.0,76.0,64.0,1011.9,0.0,0.0,0.0,0.0
29095,2015-06-30 23:00:00,Jun,Brooklyn,990,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [66]:
taxi.query('borough == "Brooklyn"').shape[0]

4343

In [67]:
taxi.groupby('borough').aggregate({'hday': 'count'})

               hday
borough
Bronx          4343
Brooklyn       4343
EWR            4343
Manhattan      4343
Queens         4343
Staten Island  4343

In [68]:
taxi.borough.value_counts()

Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

In [69]:
taxi.pickups.sum()

14265773

In [70]:
taxi.groupby('borough').aggregate({'pickups': 'sum'})

                pickups
borough
Bronx            220047
Brooklyn        2321035
EWR                 105
Manhattan      10367841
Queens          1343528
Staten Island      6957

In [71]:
taxi.groupby('borough').aggregate({'pickups': 'sum'}).idxmax()

pickups    Manhattan
dtype: object

In [72]:
taxi.groupby('borough').aggregate({'pickups': 'sum'}).idxmin()

pickups    EWR
dtype: object

In [73]:
taxi.groupby(['borough', 'hday'], as_index=False).aggregate({'pickups': 'mean'})

          borough hday      pickups
0           Bronx    N    50.771073
1           Bronx    Y    48.065868
2        Brooklyn    N   534.727969
3        Brooklyn    Y   527.011976
4             EWR    N     0.023467
5             EWR    Y     0.041916
6       Manhattan    N  2401.302921
7       Manhattan    Y  2035.928144
8          Queens    N   308.899904
9          Queens    Y   320.730539
10  Staten Island    N     1.606082
11  Staten Island    Y     1.497006

In [74]:
taxi.groupby(['borough', 'pickup_month'], as_index=False).aggregate({'pickups': 'sum'}).sort_values('pickups',
                                                                                                    ascending=False)

          borough pickup_month  pickups
21      Manhattan          Jun  1995388
23      Manhattan          May  1888800
19      Manhattan          Feb  1718571
22      Manhattan          Mar  1661261
18      Manhattan          Apr  1648278
20      Manhattan          Jan  1455543
9        Brooklyn          Jun   482466
11       Brooklyn          May   476087
6        Brooklyn          Apr   378095
10       Brooklyn          Mar   346726
7        Brooklyn          Feb   328650
8        Brooklyn          Jan   309011
27         Queens          Jun   286311
29         Queens          May   275893
28         Queens          Mar   219561
24         Queens          Apr   216857
25         Queens          Feb   185695
26         Queens          Jan   159211
5           Bronx          May    53037
3           Bronx          Jun    49006
0           Bronx          Apr    34617
4           Bronx          Mar    32232
1           Bronx          Feb    28694
2           Bronx          Jan    22461
33  Staten Island          Jun     1673
35  Staten Island          May     1517
30  Staten Island          Apr     1068
34  Staten Island          Mar      975
31  Staten Island          Feb      903
32  Staten Island          Jan      821
15            EWR          Jun       29
17            EWR          May       27
16            EWR          Mar       14
13            EWR          Feb       14
14            EWR          Jan       11
12            EWR          Apr       10

In [75]:
taxi.temp.value_counts()

37.000000    675
36.000000    595
35.000000    548
42.000000    531
38.000000    529
            ...
55.833333      6
29.833333      6
25.333333      6
33.750000      6
54.500000      6
Name: temp, Length: 295, dtype: int64

In [76]:
taxi.temp.min()

2.0

In [77]:
taxi.temp.max()

89.0

In [78]:
def temp_to_celsius(temp):
    return (temp - 32) * 5 / 9

In [79]:
temp_to_celsius(450)

232.22222222222223

In [80]:
temp_to_celsius(taxi.temp)

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp, Length: 29101, dtype: float64

In [81]:
temperatures = [-10, 0, 15, 25, 35, 450, 1000]

In [82]:
# temp_to_celsius(temperatures)
# TypeError: unsupported operand type(s) for -: 'list' and 'int'

In [83]:
bookings = pd.read_csv('https://stepik.org/media/attachments/lesson/360344/bookings.csv', sep=';')

In [84]:
bookings.shape

(119390, 21)

In [85]:
bookings_head = bookings.head(8)

In [86]:
bookings_head

,Hotel,Is Canceled,Lead Time,arrival full date,Arrival Date Year,Arrival Date Month,Arrival Date Week Number,Arrival Date Day of Month,Stays in Weekend nights,Stays in week nights,...,Adults,Children,Babies,Meal,Country,Reserved Room Type,Assigned room type,customer type,Reservation Status,Reservation status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
5,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
6,Resort Hotel,0,0,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-03
7,Resort Hotel,0,9,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,FB,PRT,C,C,Transient,Check-Out,2015-07-03

In [87]:
bookings.shape

(119390, 21)

In [88]:
bookings.dtypes

Hotel                         object
Is Canceled                    int64
Lead Time                      int64
arrival full date             object
Arrival Date Year              int64
Arrival Date Month            object
Arrival Date Week Number       int64
Arrival Date Day of Month      int64
Stays in Weekend nights        int64
Stays in week nights           int64
stays total nights             int64
Adults                         int64
Children                     float64
Babies                         int64
Meal                          object
Country                       object
Reserved Room Type            object
Assigned room type            object
customer type                 object
Reservation Status            object
Reservation status_date       object
dtype: object

In [89]:
bookings.dtypes.value_counts()

object     10
int64      10
float64     1
dtype: int64

In [90]:
def to_lower_underscore(name):
    return name.lower().replace(' ', '_')

In [91]:
bookings.rename(columns=to_lower_underscore)

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,City Hotel,0,23,2017-08-30,2017,August,35,30,2,5,...,2,0.0,0,BB,BEL,A,A,Transient,Check-Out,2017-09-06
119386,City Hotel,0,102,2017-08-31,2017,August,35,31,2,5,...,3,0.0,0,BB,FRA,E,E,Transient,Check-Out,2017-09-07
119387,City Hotel,0,34,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,DEU,D,D,Transient,Check-Out,2017-09-07
119388,City Hotel,0,109,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2017-09-07
119389,City Hotel,0,205,2017-08-29,2017,August,35,29,2,7,...,2,0.0,0,HB,DEU,A,A,Transient,Check-Out,2017-09-07

In [92]:
bookings = bookings.rename(columns=to_lower_underscore)

In [93]:
bookings

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,City Hotel,0,23,2017-08-30,2017,August,35,30,2,5,...,2,0.0,0,BB,BEL,A,A,Transient,Check-Out,2017-09-06
119386,City Hotel,0,102,2017-08-31,2017,August,35,31,2,5,...,3,0.0,0,BB,FRA,E,E,Transient,Check-Out,2017-09-07
119387,City Hotel,0,34,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,DEU,D,D,Transient,Check-Out,2017-09-07
119388,City Hotel,0,109,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2017-09-07
119389,City Hotel,0,205,2017-08-29,2017,August,35,29,2,7,...,2,0.0,0,HB,DEU,A,A,Transient,Check-Out,2017-09-07

In [94]:
bookings.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_full_date',
       'arrival_date_year', 'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'stays_total_nights', 'adults', 'children',
       'babies', 'meal', 'country', 'reserved_room_type', 'assigned_room_type',
       'customer_type', 'reservation_status', 'reservation_status_date'],
      dtype='object')

In [95]:
bookings.query('is_canceled == 0').country.value_counts()[:5]

PRT    21071
GBR     9676
FRA     8481
ESP     6391
DEU     6069
Name: country, dtype: int64

In [96]:
bookings.groupby('hotel').aggregate({'stays_total_nights': 'mean'}).round(2)

              stays_total_nights
hotel
City Hotel                  2.98
Resort Hotel                4.32

In [97]:
bookings[['reserved_room_type', 'assigned_room_type']]

       reserved_room_type assigned_room_type
0                       C                  C
1                       C                  C
2                       A                  C
3                       A                  A
4                       A                  A
...                   ...                ...
119385                  A                  A
119386                  E                  E
119387                  D                  D
119388                  A                  A
119389                  A                  A

[119390 rows x 2 columns]

In [98]:
bookings.query('reserved_room_type != assigned_room_type')

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
12,Resort Hotel,0,68,2015-07-01,2015,July,27,1,0,4,...,2,0.0,0,BB,USA,D,E,Transient,Check-Out,2015-07-05
15,Resort Hotel,0,68,2015-07-01,2015,July,27,1,0,4,...,2,0.0,0,BB,IRL,D,E,Transient,Check-Out,2015-07-05
17,Resort Hotel,0,12,2015-07-01,2015,July,27,1,0,1,...,2,0.0,0,BB,IRL,A,E,Transient,Check-Out,2015-07-02
18,Resort Hotel,0,0,2015-07-01,2015,July,27,1,0,1,...,2,0.0,0,BB,FRA,A,G,Transient,Check-Out,2015-07-02
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119273,City Hotel,0,213,2017-08-28,2017,August,35,28,1,3,...,1,0.0,0,HB,PRT,A,K,Transient-Party,Check-Out,2017-09-01
119274,City Hotel,0,213,2017-08-28,2017,August,35,28,1,3,...,1,0.0,0,HB,PRT,A,K,Transient-Party,Check-Out,2017-09-01
119289,City Hotel,0,25,2017-08-30,2017,August,35,30,0,3,...,3,0.0,0,BB,ITA,E,F,Transient,Check-Out,2017-09-02
119297,City Hotel,0,332,2017-08-31,2017,August,35,31,0,2,...,2,0.0,0,BB,GBR,D,F,Transient,Check-Out,2017-09-02
119357,City Hotel,0,47,2017-08-31,2017,August,35,31,1,3,...,1,0.0,0,SC,PRT,A,D,Transient,Check-Out,2017-09-04

In [99]:
bookings.query('arrival_date_year == 2016').arrival_date_month.value_counts()

October      6203
May          5478
April        5428
September    5394
June         5292
August       5063
March        4824
July         4572
November     4454
February     3891
December     3860
January      2248
Name: arrival_date_month, dtype: int64

In [100]:
bookings.query('arrival_date_year == 2017').arrival_date_month.value_counts()

May         6313
April       5661
June        5647
July        5313
March       4970
August      4925
February    4177
January     3681
Name: arrival_date_month, dtype: int64

In [101]:
bookings

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,City Hotel,0,23,2017-08-30,2017,August,35,30,2,5,...,2,0.0,0,BB,BEL,A,A,Transient,Check-Out,2017-09-06
119386,City Hotel,0,102,2017-08-31,2017,August,35,31,2,5,...,3,0.0,0,BB,FRA,E,E,Transient,Check-Out,2017-09-07
119387,City Hotel,0,34,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,DEU,D,D,Transient,Check-Out,2017-09-07
119388,City Hotel,0,109,2017-08-31,2017,August,35,31,2,5,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2017-09-07
119389,City Hotel,0,205,2017-08-29,2017,August,35,29,2,7,...,2,0.0,0,HB,DEU,A,A,Transient,Check-Out,2017-09-07

In [102]:
bookings.query('hotel == "City Hotel" and is_canceled == 1').groupby(
    'arrival_date_year').arrival_date_month.value_counts()

arrival_date_year  arrival_date_month
2015               September             1543
                   October               1321
                   August                1232
                   July                   939
                   December               668
                   November               301
2016               October               1947
                   June                  1720
                   September             1567
                   April                 1539
                   May                   1436
                   November              1360
                   August                1247
                   March                 1108
                   December              1072
                   July                  1043
                   February               930
                   January                438
2017               May                   2217
                   April                 1926
                   June                  1808
                   July                  1324
                   March                 1278
                   August                1123
                   January               1044
                   February               971
Name: arrival_date_month, dtype: int64

In [103]:
bookings[['adults', 'children', 'babies']]

        adults  children  babies
0            2       0.0       0
1            2       0.0       0
2            1       0.0       0
3            1       0.0       0
4            2       0.0       0
...        ...       ...     ...
119385       2       0.0       0
119386       3       0.0       0
119387       2       0.0       0
119388       2       0.0       0
119389       2       0.0       0

[119390 rows x 3 columns]

In [104]:
bookings[['adults', 'children', 'babies']].describe()

              adults       children         babies
count  119390.000000  119386.000000  119390.000000
mean        1.856403       0.103890       0.007949
std         0.579261       0.398561       0.097436
min         0.000000       0.000000       0.000000
25%         2.000000       0.000000       0.000000
50%         2.000000       0.000000       0.000000
75%         2.000000       0.000000       0.000000
max        55.000000      10.000000      10.000000

In [105]:
bookings[['adults', 'children', 'babies']].mean()

adults      1.856403
children    0.103890
babies      0.007949
dtype: float64

In [106]:
bookings['total_kids'] = bookings.children + bookings.babies

In [107]:
bookings.total_kids

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
         ...
119385    0.0
119386    0.0
119387    0.0
119388    0.0
119389    0.0
Name: total_kids, Length: 119390, dtype: float64

In [108]:
bookings.groupby('hotel').aggregate({'total_kids': 'mean'}).round(2)

              total_kids
hotel
City Hotel          0.10
Resort Hotel        0.14

In [109]:
bookings['has_kids'] = bookings.total_kids > 0

In [110]:
bookings.query('has_kids == False and is_canceled == 1')

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date,total_kids,has_kids
8,Resort Hotel,1,85,2015-07-01,2015,July,27,1,0,3,...,0,BB,PRT,A,A,Transient,Canceled,2015-05-06,0.0,False
9,Resort Hotel,1,75,2015-07-01,2015,July,27,1,0,3,...,0,HB,PRT,D,D,Transient,Canceled,2015-04-22,0.0,False
10,Resort Hotel,1,23,2015-07-01,2015,July,27,1,0,4,...,0,BB,PRT,E,E,Transient,Canceled,2015-06-23,0.0,False
27,Resort Hotel,1,60,2015-07-01,2015,July,27,1,2,5,...,0,BB,PRT,E,E,Transient,Canceled,2015-05-11,0.0,False
32,Resort Hotel,1,96,2015-07-01,2015,July,27,1,2,8,...,0,BB,PRT,E,E,Transient,Canceled,2015-05-29,0.0,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110280,City Hotel,1,132,2017-04-25,2017,April,17,25,0,0,...,0,BB,FRA,D,K,Transient,Canceled,2017-04-25,0.0,False
111355,City Hotel,1,4,2017-06-05,2017,June,23,5,1,0,...,0,BB,PRT,A,A,Transient,Canceled,2017-06-05,0.0,False
111924,City Hotel,1,7,2017-05-31,2017,May,22,31,0,1,...,0,BB,PRT,A,A,Transient,Canceled,2017-05-31,0.0,False
111925,City Hotel,1,6,2017-07-17,2017,July,29,17,1,0,...,0,BB,PRT,A,D,Transient,No-Show,2017-07-17,0.0,False
117295,City Hotel,1,0,2017-08-02,2017,August,31,2,0,2,...,0,BB,PRT,A,C,Transient,No-Show,2017-08-02,0.0,False

In [111]:
x = bookings.query('has_kids == False and is_canceled == 1').shape[0]

In [112]:
y = bookings.query('has_kids == False').shape[0]

In [113]:
x / y

0.37221283323338605

In [114]:
(x / y) * 100

37.221283323338604

In [115]:
round((x / y) * 100)

37